# Temas vistos el 23 de noviembre del 2022
[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/danielroa98/Postgrad-ML/blob/main/Module-1/23_Nov_2022_lec_05_M1G6P_DRG.ipynb)

Para información adicional de los ejercicios hechos anteriormente, ver el Notebook de la [lectura 4](./16_Nov_2022_lec_04_M1G6P_DRG.ipynb).

In [1]:
import pandas as pd
import numpy as np

In [3]:
emp = pd.read_csv('./Datasets/employees.csv', parse_dates=['hire_date'])
emp.head(6)

,employee_id,first_name,last_name,email,hire_date,department,gender,salary,region_id
0,1,Berrie,Manueau,bmanueau0@dion.ne.jp,2006-04-20,Sports,F,154864,4
1,2,Aeriell,McNee,amcnee1@google.es,2009-01-26,Tools,F,56752,3
2,3,Sydney,Symonds,ssymonds2@hhs.gov,2010-05-17,Clothing,F,95313,4
3,4,Avrom,Rowantree,NaN,2014-02-08,Phones & Tablets,M,119674,7
4,5,Feliks,Morffew,fmorffew4@a8.net,2003-01-14,Computers,M,55307,5
5,6,Bethena,Trow,btrow5@technorati.com,2003-08-06,Sports,F,134501,3

### Continuación de ejercicios...

In [5]:
emp['salary'].describe()

count      1000.000000
mean      91571.594000
std       42028.902067
min       20542.000000
25%       55292.250000
50%       89686.500000
75%      126997.750000
max      166976.000000
Name: salary, dtype: float64

#### 5) Utilizando los valores obtenidos por el método _describe_, construye una función que determine si el salario es:
- 'bajo', si salario <= perecntil 25
- 'medio' si el salario está entre percentil 25 (excluyendo) y el percentil 75 (inclusivo)
- 'alto' si el salario mayor al percentil 75.

In [6]:
def salary_classifier(salary_value):
    if salary_value <= 55292.25:
        return 'bajo'
    elif salary_value <= 126997.75:
        return 'medio'
    else:
        return 'alto'

#### 6) Aplica la función del punto anterior para la columna salary para ver el resultado

In [7]:
emp['salary'].apply(salary_classifier)
# Sintaxis
# serie.apply(nombre_de_la_función)

0       alto
1      medio
2      medio
3      medio
4      medio
       ...
995    medio
996    medio
997     alto
998     bajo
999     bajo
Name: salary, Length: 1000, dtype: object

Se podía definir una columna nueva para guardar estos resultados
```
emp['salary_range'] = emp['salary'].apply(salary_classifier)
```

#### 7) ¿Cuántos salarios bajos, medios y altos hay?

In [8]:
emp['salary'].apply(salary_classifier).value_counts()

medio    500
alto     250
bajo     250
Name: salary, dtype: int64

#### 8) Se quieren los resultados de la pregunta 7 en frecuencias relativas.

In [10]:
emp['salary'].apply(salary_classifier).value_counts(normalize=True)*100

medio    50.0
alto     25.0
bajo     25.0
Name: salary, dtype: float64

#### 9) ¿Cuántos departamentos hay?

In [14]:
emp['department'].nunique()
# Lo anterior es como utilizar emp['department'].unique() y después contarlos.

27

#### 10) Supongamos que a todos los empleados se les dará un aumento del 10%, crear una nueva columna llamada 'new_salary' que contenga el nuevo salario

In [15]:
emp['new_salary'] = emp['salary'].apply(lambda x:x*1.1)

#### Alternativa utilizando broadcasting
```emp['new_salary'] = emp['salary']*1.1```

In [16]:
emp.head()

,employee_id,first_name,last_name,email,hire_date,department,gender,salary,region_id,new_salary
0,1,Berrie,Manueau,bmanueau0@dion.ne.jp,2006-04-20,Sports,F,154864,4,170350.4
1,2,Aeriell,McNee,amcnee1@google.es,2009-01-26,Tools,F,56752,3,62427.2
2,3,Sydney,Symonds,ssymonds2@hhs.gov,2010-05-17,Clothing,F,95313,4,104844.3
3,4,Avrom,Rowantree,NaN,2014-02-08,Phones & Tablets,M,119674,7,131641.4
4,5,Feliks,Morffew,fmorffew4@a8.net,2003-01-14,Computers,M,55307,5,60837.7

#### 11) ¿Cuántos valores nulos tiene la columna 'email'?

In [17]:
emp['email'].isnull().sum()

204

In [18]:
# Utilizando el alias
emp['email'].isna().sum()

204

## Creando un DataFrame, utilizando un diccionario

In [20]:
dic_data = {
    'producto': ['laptop', 'tabler', 'celular', 'reloj'],
    'precio': [3000, 13500, 2800, 19600]
}
df = pd.DataFrame(dic_data)
df

  producto  precio
0   laptop    3000
1   tabler   13500
2  celular    2800
3    reloj   19600

In [21]:
dic_2 = pd.DataFrame(dic_data, index=['prod1', 'prod2', 'prod3', 'prod4'])
dic_2

      producto  precio
prod1   laptop    3000
prod2   tabler   13500
prod3  celular    2800
prod4    reloj   19600

##

In [22]:
emp = pd.read_csv('./Datasets/employees_2.csv')
emp.head(6)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal

In [23]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

Converting to datetime

In [25]:
pd.to_datetime(emp['Start Date'])

0     1993-08-06
1     1996-03-31
2     1993-04-23
3     2005-03-04
4     1998-01-24
         ...
995   2014-11-23
996   1984-01-31
997   2013-05-20
998   2013-04-20
999   2012-05-15
Name: Start Date, Length: 1000, dtype: datetime64[ns]

In [26]:
emp['Start Date'] = pd.to_datetime(emp['Start Date'])
emp['Last Login Time'] = pd.to_datetime(emp['Last Login Time'])

emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services

In [27]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 62.6+ KB

In [29]:
# emp['Senior Management'].value_counts()
emp['Senior Management'].unique()
# Cómo hay valores que no están definidos como booleanos, se van a definir así.

array([True, False, nan], dtype=object)

In [30]:
emp['Senior Management'] = emp['Senior Management'].astype('bool')
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [32]:
emp['Gender'] = emp['Gender'].astype('category')
emp.dtypes

First Name                   object
Gender                     category
Start Date           datetime64[ns]
Last Login Time      datetime64[ns]
Salary                        int64
Bonus %                     float64
Senior Management              bool
Team                         object
dtype: object

## Filtrando DataFrames según ciertos criterios

In [35]:
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services

### Utilizando máscaras booleanas

In [36]:
is_male = emp['Gender'] == 'Male'
is_male

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996     True
997     True
998     True
999     True
Name: Gender, Length: 1000, dtype: bool

Una forma para filtrar a los hombres puede ser de la siguiente manera:

In [37]:
# Sólo devuelve los renglones que cumplan la condición establecida anteriormente.
emp[is_male]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-11-23 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-11-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

El equivalente pero con menos paso sería lo siguiente:

In [38]:
emp[emp['Gender'] == 'Male']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-11-23 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-11-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

Es el equivalente, solo que comprimido:
| Original                           | Shortened                             |
|------------------------------------|---------------------------------------|
| is_male  = emp['Gender'] == 'Male' | emp [ emp [ 'Gender' ]  ==   'Male' ] |

### Filtrar por columna __Team__

In [42]:
marketing = emp['Team'] == 'Marketing'
emp[marketing]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2022-11-23 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2022-11-23 07:45:00,37598,7.757,True,Marketing
43,Marilyn,Female,1980-12-07,2022-11-23 03:16:00,73524,5.207,True,Marketing
62,NaN,Female,2007-06-12,2022-11-23 17:25:00,58112,19.414,True,Marketing
...,...,...,...,...,...,...,...,...
942,Lori,Female,2015-11-20,2022-11-23 13:15:00,75498,6.537,True,Marketing
947,NaN,Male,2012-07-30,2022-11-23 15:07:00,107351,5.329,True,Marketing
986,Donna,Female,1982-11-26,2022-11-23 07:04:00,82871,17.999,False,Marketing
991,Rose,Female,2002-08-25,2022-11-23 05:12:00,134505,11.051,True,Marketing
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing

In [43]:
# Para corroborar que si funcionó la máscara booleana
emp[marketing]['Team'].unique()

array(['Marketing'], dtype=object)

#### Filtrar a los empleados que son Senior Management

Esto se puede hacer ya que se están manejando valores booleanos en la serie _Senior Management_, entonces actúa como una máscara booleana por default.

In [46]:
sm = emp['Senior Management']
sm

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: bool

In [47]:
emp[emp['Senior Management']]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2022-11-23 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2022-11-23 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-11-23 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-11-23 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

In [48]:
emp['Team'].value_counts()

Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

#### Extraer a todos menos a los de legal

In [49]:
not_legal = emp['Team'] != 'Legal'
not_legal

0      True
1      True
2      True
3      True
4      True
       ...
995    True
996    True
997    True
998    True
999    True
Name: Team, Length: 1000, dtype: bool

Se excluirán todos los registros que pertenezcan al equipo de _Legal_.

In [50]:
emp[not_legal]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2022-11-23 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-11-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

Corroborando

In [51]:
emp[not_legal]['Team'].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

#### Filtrar a los que __no son__ del área Legal y cuyo salario es mayor a la mediana

In [52]:
emp['Salary'].describe()

count      1000.000000
mean      90662.181000
std       32923.693342
min       35013.000000
25%       62613.000000
50%       90428.000000
75%      118740.250000
max      149908.000000
Name: Salary, dtype: float64

In [53]:
emp[not_legal][emp[not_legal]['Salary']>90428]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
8,Angela,Female,2005-11-22,2022-11-23 06:29:00,95570,18.523,True,Engineering
...,...,...,...,...,...,...,...,...
992,Anthony,Male,2011-10-16,2022-11-23 08:35:00,112769,11.625,True,Finance
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-23 06:09:00,132483,16.655,False,Distribution
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

Sintáxis de lo anterior:
```
df[df[col_name] <boolean operation (==, !=, >, >=, <, <= )> conditional]
```

In [55]:
salary_gt_median = emp['Salary'] > 90428

In [56]:
emp[not_legal & salary_gt_median]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
8,Angela,Female,2005-11-22,2022-11-23 06:29:00,95570,18.523,True,Engineering
...,...,...,...,...,...,...,...,...
992,Anthony,Male,2011-10-16,2022-11-23 08:35:00,112769,11.625,True,Finance
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-23 06:09:00,132483,16.655,False,Distribution
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

#### Filtrar a los empleados cuya fecha de inicio fue igual o antes al primero de febrero de 1988 (1988-02-01)

In [67]:
extracted_dates = emp['Start Date'] >= '1988-02-01'

In [68]:
emp[emp['Start Date'] >= '1988-02-01']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-23 06:09:00,132483,16.655,False,Distribution
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

In [69]:
emp[extracted_dates]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-11-23 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-23 06:09:00,132483,16.655,False,Distribution
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

In [70]:
emp[extracted_dates]['Start Date'].min()

Timestamp('1988-02-02 00:00:00')

#### Filtrar por mas de una condición

Extraer a los hombres de Engineering

In [71]:
cond1 = emp['Gender'] == 'Male'
cond2 = emp['Team'] == 'Engineering'
emp[cond1 & cond2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
171,Patrick,Male,2007-08-17,2022-11-23 03:16:00,143499,17.495,True,Engineering
175,Willie,Male,1998-02-17,2022-11-23 20:20:00,146651,1.451,True,Engineering
228,Bobby,Male,1994-09-23,2022-11-23 01:29:00,51685,17.445,True,Engineering
242,Robert,Male,1990-10-27,2022-11-23 19:15:00,38041,18.428,True,Engineering
245,Victor,Male,1991-04-11,2022-11-23 07:44:00,70817,17.138,False,Engineering
283,Todd,Male,2009-03-11,2022-11-23 03:43:00,107281,1.612,True,Engineering
300,Alan,Male,1988-06-26,2022-11-23 03:54:00,111786,3.592,True,Engineering
301,James,Male,2015-07-11,2022-11-23 20:52:00,72257,13.023,False,Engineering
329,NaN,Male,2010-01-27,2022-11-23 02:57:00,87760,14.987,True,Engineering
343,Ronald,Male,2009-02-24,2022-11-23 14:09:00,96633,4.990,True,Engineering
352,NaN,Male,2011-10-09,2022-11-23 09:29:00,69906,4.844,True,Engineering
357,Russell,Male,2014-08-13,2022-11-23 15:51:00,121160,7.843,False,Engineering
372,Albert,Male,1997-02-01,2022-11-23 16:20:00,67827,19.717,True,Engineering
376,Brandon,Male,2015-10-16,2022-11-23 02:44:00,112548,4.664,False,Engineering
381,Scott,Male,1996-08-03,2022-11-23 01:50:00,64172,10.894,True,Engineering
447,Gregory,Male,2009-05-15,2022-11-23 15:52:00,142208,11.204,True,Engineering
462,Craig,Male,1996-04-14,2022-11-23 09:17:00,125556,7.996,False,Engineering
474,Jonathan,Male,2002-08-15,2022-11-23 00:01:00,104749,11.364,False,Engineering
505,NaN,Male,1980-04-20,2022-11-23 13:17:00,71520,13.248,True,Engineering
507,Clarence,Male,2015-11-03,2022-11-23 00:11:00,103684,18.654,True,Engineering
551,Philip,Male,1985-07-18,2022-11-23 06:36:00,122319,19.122,False,Engineering
563,Randy,Male,2002-05-02,2022-11-23 19:39:00,86723,14.842,False,Engineering
604,Bruce,Male,2013-03-15,2022-11-23 23:13:00,141335,15.427,True,Engineering
615,Edward,Male,2001-08-30,2022-11-23 01:24:00,73105,6.083,True,Engineering
652,Willie,Male,2009-12-05,2022-11-23 05:39:00,141932,1.017,True,Engineering
661,Craig,Male,1995-08-21,2022-11-23 02:38:00,123876,4.225,False,Engineering
680,Albert,Male,1992-06-17,2022-11-23 03:25:00,86818,14.301,True,Engineering
705,Harry,Male,2015-09-23,2022-11-23 01:36:00,129148,15.193,True,Engineering
715,Peter,Male,1982-03-22,2022-11-23 07:28:00,77933,13.132,True,Engineering
718,Terry,Male,2010-10-21,2022-11-23 23:18:00,58357,7.969,False,Engineering
719,John,Male,1999-01-29,2022-11-23 03:07:00,67165,13.001,False,Engineering
805,Thomas,Male,1990-05-03,2022-11-23 09:29:00,111371,15.081,True,Engineering
823,NaN,Male,2009-11-12,2022-11-23 14:30:00,109411,9.494,True,Engineering
835,Douglas,Male,2007-08-04,2022-11-23 05:23:00,132175,2.280,False,Engineering
871,Gerald,Male,2003-03-29,2022-11-23 10:37:00,96329,2.469,True,Engineering
934,Samuel,Male,1997-08-07,2022-11-23 12:40:00,43694,3.787,True,Engineering
941,William,Male,1997-06-26,2022-11-23 08:33:00,104840,15.653,True,Engineering
943,Wayne,Male,2006-09-08,2022-11-23 11:09:00,67471,2.728,False,Engineering
967,Thomas,Male,2016-03-12,2022-11-23 15:10:00,105681,19.572,False,Engineering
983,John,Male,1982-12-23,2022-11-23 22:35:00,146907,11.738,False,Engineering

In [73]:
cond = emp['Team'].isnull()
emp[cond]
# Regresará todos los renglones donde Team sea Null (NaN).

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2022-11-23 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2022-11-23 16:19:00,125792,5.042,True,NaN
32,NaN,Male,1998-08-21,2022-11-23 14:27:00,122340,6.417,True,NaN
91,James,NaN,2005-01-26,2022-11-23 23:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,2022-11-23 10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,2022-11-23 01:08:00,132373,10.527,True,NaN
199,Jonathan,Male,2009-07-17,2022-11-23 08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,2022-11-23 03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,2022-11-23 18:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,2022-11-23 17:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,2022-11-23 06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,2022-11-23 15:57:00,107024,12.182,True,NaN
434,Joyce,Female,1995-02-07,2022-11-23 07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,2022-11-23 14:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,2022-11-23 01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,2022-11-23 11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,2022-11-23 03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,2022-11-23 19:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,2022-11-23 09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,2022-11-23 20:04:00,48141,12.605,True,NaN
573,Kimberly,Female,1981-12-30,2022-11-23 04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,2022-11-23 20:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,2022-11-23 08:03:00,131755,2.930,True,NaN
634,Carl,Male,1987-03-30,2022-11-23 17:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,2022-11-23 03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,2022-11-23 10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,2022-11-23 13:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,2022-11-23 17:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,2022-11-23 18:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,2022-11-23 04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,2022-11-23 22:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,2022-11-23 07:36:00,106428,10.867,True,NaN
781,Lawrence,Male,1995-07-03,2022-11-23 22:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,2022-11-23 17:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,2022-11-23 01:35:00,87103,5.665,True,NaN
850,Charles,Male,1997-09-03,2022-11-23 10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,2022-11-23 01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,2022-11-23 22:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,2022-11-23 11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,2022-11-23 13:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,2022-11-23 10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,2022-11-23 05:19:00,143638,9.662,True,NaN

### Using AND and OR
#### (Name = 'Robert' and Team = 'Client Services') OR start_date > jun 2, 2016

In [74]:
c1 = emp['First Name'] == 'Robert'
c2 = emp['Team'] == 'Client Services'
c3 = emp['Start Date'] > '2016-06-02'

In [75]:
emp[(c1&c2)|c3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2022-11-23 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2022-11-23 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2022-11-23 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2022-11-23 00:29:00,140002,19.490,True,Marketing

In [76]:
emp.sort_values('Start Date', ascending=False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
451,Terry,NaN,2016-07-15,2022-11-23 00:29:00,140002,19.490,True,Marketing
98,Tina,Female,2016-06-16,2022-11-23 19:47:00,100705,16.961,True,Marketing
15,Lillian,Female,2016-06-05,2022-11-23 06:09:00,59414,1.256,False,Product
444,NaN,Male,2016-05-24,2022-11-23 21:17:00,76409,7.008,True,Distribution
239,Lillian,NaN,2016-05-12,2022-11-23 15:43:00,64164,17.612,False,Human Resources
...,...,...,...,...,...,...,...,...
549,Sara,Female,1980-02-25,2022-11-23 22:50:00,75484,3.186,False,Finance
272,Fred,Male,1980-02-20,2022-11-23 02:25:00,74129,18.225,False,Product
881,Ruby,Female,1980-01-28,2022-11-23 23:08:00,142868,6.318,False,Marketing
49,Chris,NaN,1980-01-24,2022-11-23 12:13:00,113590,3.055,False,Sales
954,Joe,Male,1980-01-19,2022-11-23 16:06:00,119667,1.148,True,Finance

### Método .isin()

Una manera mas sencilla de extraer valores que hagan _match_ con varios criterios (o valores) es el método `isin()`.

.isin() -> equivalente al `IN` en SQL.

`columna.isin(list)`

In [78]:
cond = emp['First Name'].isin(['Angela','Ruby','Thomas'])

In [79]:
emp[cond]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2022-11-23 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2022-11-23 16:20:00,65476,10.012,True,Product
8,Angela,Female,2005-11-22,2022-11-23 06:29:00,95570,18.523,True,Engineering
74,Thomas,Male,1995-06-04,2022-11-23 14:24:00,62096,17.029,False,Marketing
270,Thomas,Male,2011-04-06,2022-11-23 13:04:00,103235,9.554,True,Human Resources
279,Ruby,Female,2000-11-08,2022-11-23 19:35:00,105946,1.139,False,Business Development
324,Ruby,Female,1988-12-10,2022-11-23 20:27:00,76707,6.031,False,Business Development
350,Thomas,NaN,1995-08-31,2022-11-23 20:31:00,41549,3.950,False,Sales
541,Ruby,Female,1999-05-01,2022-11-23 03:36:00,147362,7.851,True,Engineering
569,Ruby,Female,1980-07-07,2022-11-23 03:42:00,101262,6.773,False,Client Services
704,Thomas,Male,1991-09-07,2022-11-23 09:51:00,65251,11.211,False,Distribution
805,Thomas,Male,1990-05-03,2022-11-23 09:29:00,111371,15.081,True,Engineering
817,Ruby,Female,2008-05-31,2022-11-23 20:41:00,83112,4.083,False,Marketing
841,Ruby,Female,2006-08-13,2022-11-23 18:27:00,48354,19.501,False,Business Development
881,Ruby,Female,1980-01-28,2022-11-23 23:08:00,142868,6.318,False,Marketing
967,Thomas,Male,2016-03-12,2022-11-23 15:10:00,105681,19.572,False,Engineering

In [80]:
cond = emp['Team'].notnull()

In [81]:
emp[cond]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-23 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2022-11-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-23 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-11-23 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2022-11-23 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-11-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-11-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-23 18:24:00,129949,10.169,True,Sales

In [82]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB